[
    {
        "area": "British",
        "category": "Dessert",
        "id": "52768",
        "img_url": "https://www.themealdb.com/images/media/meals/wxywrq1468235067.jpg",
        "ingredient": "175g/6oz digestive biscuits\n75g/3oz butter\n200g/7oz Bramley apples\n75g/3oz butter, softened\n75g/3oz caster sugar\n2 free-range eggs, beaten\n75g/3oz ground almonds\n1 tsp almond extract\n50g/1¾oz flaked almonds",
        "instructions": "Preheat the oven to 200C/180C Fan/Gas 6.\nPut the biscuits in a large re-sealable freezer bag and bash with a rolling pin into fine crumbs. Melt the butter in a small pan, then add the biscuit crumbs and stir until coated with butter. Tip into the tart tin and, using the back of a spoon, press over the base and sides of the tin to give an even layer.\nChill in the fridge while you make the filling.\nCream together the butter and sugar until light and fluffy. You can do this in a food processor if you have one. Process for 2-3 minutes. Mix in the eggs, then add the ground almonds and almond extract and blend until well combined.\nPeel the apples, and cut thin slices of apple. Do this at the last minute to prevent the apple going brown. Arrange the slices over the biscuit base. Spread the frangipane filling evenly on top. Level the surface and sprinkle with the flaked almonds.\nBake for 20-25 minutes until golden-brown and set.\nRemove from the oven and leave to cool for 15 minutes. Remove the sides of the tin.\nAn easy way to do this is to stand the tin on a can of beans and push down gently on the edges of the tin.\nTransfer the tart, with the tin base attached, to a serving plate. Serve warm with cream, crème fraiche or ice cream.",
        "name": "Apple Frangipan Tart",
        "tag": "Tart,Baking,Fruity",
        "video_url": "https://www.youtube.com/watch?v=rp8Slv4INLk"
    },
    {
        "area": "Malaysian",
        "category": "Dessert",
        "id": "53049",
        "img_url": "https://www.themealdb.com/images/media/meals/adxcbq1619787919.jpg",
        "ingredient": "200ml Milk\n60ml Oil\n2 Eggs\n1600g Flour\n3 tsp Baking Powder\n1/2 tsp Salt\n25g Unsalted Butter\n45g Sugar\n3 tbs Peanut Butter",
        "instructions": "Mix milk, oil and egg together. Sift flour, baking powder and salt into the mixture. Stir well until all ingredients are combined evenly.\nSpread some batter onto the pan. Spread a thin layer of batter to the side of the pan. Cover the pan for 30-60 seconds until small air bubbles appear.\nAdd butter, cream corn, crushed peanuts and sugar onto the pancake. Fold the pancake into half once the bottom surface is browned.\nCut into wedges and best eaten when it is warm.",
        "name": "Apam balik",
        "tag": "Baking",
        "video_url": "https://www.youtube.com/watch?v=6R8ffRRJcrg"
    }, 
    {
        "area": "Malaysian",
        "category": "Chicken",
        "id": "53050",
        "img_url": "https://www.themealdb.com/images/media/meals/020z181619788503.jpg",
        "ingredient": "6 Chicken Thighs\n16 Challots\n1 1/2  Ginger\n6 Garlic Clove\n8 Cayenne Pepper\n2 tbs Turmeric\n1 1/2  Cumin\n1 1/2  Coriander\n1 1/2  Fennel\n2 tbs Tamarind Paste\n1 can  Coconut Milk\n1 tsp  Sugar\n1 cup  Water",
        "instructions": "In a blender, add the ingredients for the spice paste and blend until smooth.\nOver medium heat, pour the spice paste in a skillet or pan and fry for 10 minutes until fragrant. Add water or oil 1 tablespoon at a time if the paste becomes too dry. Don't burn the paste. Lower the fire slightly if needed.\nAdd the cloves, cardamom, tamarind pulp, coconut milk, water, sugar and salt. Turn the heat up and bring the mixture to boil. Turn the heat to medium low and simmer for 10 minutes.\nStir occasionally. It will reduce slightly. This is the marinade/sauce, so taste and adjust seasoning if necessary. Don't worry if it's slightly bitter. It will go away when roasting.\nWhen the marinade/sauce has cooled, pour everything over the chicken and marinate overnight to two days.\nPreheat the oven to 425 F.\nRemove the chicken from the marinade. Spoon the marinade onto a greased (or aluminum lined) baking sheet. Lay the chicken on top of the sauce (make sure the chicken covers the sauce and the sauce isn't exposed or it'll burn) and spread the remaining marinade on the chicken. Roast for 35-45 minutes or until internal temp of the thickest part of chicken is at least 175 F.\nLet chicken rest for 5 minutes. Brush the chicken with some of the oil. Serve chicken with the sauce over steamed rice (or coconut rice).",
        "name": "Ayam Percik",
        "tag": null,
        "video_url": "https://www.youtube.com/watch?v=9ytR28QK6I8"
    },
    {
        "area": "Turkish",
        "category": "Side",
        "id": "52977",
        "img_url": "https://www.themealdb.com/images/media/meals/58oia61564916529.jpg",
        "ingredient": "1 cup  Lentils\n1 large Onion\n1 large Carrots\n1 tbs Tomato Puree\n2 tsp Cumin\n1 tsp  Paprika\n1/2 tsp Mint\n1/2 tsp Thyme\n1/4 tsp Black Pepper\n1/4 tsp Red Pepper Flakes\n4 cups  Vegetable Stock\n1 cup  Water\nPinch Sea Salt",
        "instructions": "Pick through your lentils for any foreign debris, rinse them 2 or 3 times, drain, and set aside.  Fair warning, this will probably turn your lentils into a solid block that you'll have to break up later\nIn a large pot over medium-high heat, sauté the olive oil and the onion with a pinch of salt for about 3 minutes, then add the carrots and cook for another 3 minutes.\nAdd the tomato paste and stir it around for around 1 minute. Now add the cumin, paprika, mint, thyme, black pepper, and red pepper as quickly as you can and stir for 10 seconds to bloom the spices. Congratulate yourself on how amazing your house now smells.\nImmediately add the lentils, water, broth, and salt. Bring the soup to a (gentle) boil.\nAfter it has come to a boil, reduce heat to medium-low, cover the pot halfway, and cook for 15-20 minutes or until the lentils have fallen apart and the carrots are completely cooked.\nAfter the soup has cooked and the lentils are tender, blend the soup either in a blender or simply use a hand blender to reach the consistency you desire. Taste for seasoning and add more salt if necessary.\nServe with crushed-up crackers, torn up bread, or something else to add some extra thickness.  You could also use a traditional thickener (like cornstarch or flour), but I prefer to add crackers for some texture and saltiness.  Makes great leftovers, stays good in the fridge for about a week.",
        "name": "Corba",
        "tag": "Soup",
        "video_url": "https://www.youtube.com/watch?v=VVnZd8A84z4"
    }, 
    {
        "area": "Japanese",
        "category": "Seafood",
        "id": "53065",
        "img_url": "https://www.themealdb.com/images/media/meals/g046bb1663960946.jpg",
        "ingredient": "300ml  Sushi Rice\n100ml Rice wine\n2 tbs Caster Sugar\n3 tbs Mayonnaise\n1 tbs Rice wine\n1 tbs Soy Sauce\n1 Cucumber",
        "instructions": "\nTO MAKE SUSHI ROLLS: Pat out some rice. Lay a nori sheet on the mat, shiny-side down. Dip your hands in the vinegared water, then pat handfuls of rice on top in a 1cm thick layer, leaving the furthest edge from you clear.\nSpread over some Japanese mayonnaise. Use a spoon to spread out a thin layer of mayonnaise down the middle of the rice.\nAdd the filling. Get your child to top the mayonnaise with a line of their favourite fillings - here we've used tuna and cucumber.\nRoll it up. Lift the edge of the mat over the rice, applying a little pressure to keep everything in a tight roll.\nStick down the sides like a stamp. When you get to the edge without any rice, brush with a little water and continue to roll into a tight roll.\nWrap in cling film. Remove the mat and roll tightly in cling film before a grown-up cuts the sushi into thick slices, then unravel the cling film.\nTO MAKE PRESSED SUSHI: Layer over some smoked salmon. Line a loaf tin with cling film, then place a thin layer of smoked salmon inside on top of the cling film.\nCover with rice and press down. Press about 3cm of rice over the fish, fold the cling film over and press down as much as you can, using another tin if you have one.\nTip it out like a sandcastle. Turn block of sushi onto a chopping board. Get a grown-up to cut into fingers, then remove the cling film.0\nTO MAKE SUSHI BALLS: Choose your topping. Get a small square of cling film and place a topping, like half a prawn or a small piece of smoked salmon, on it. Use damp hands to roll walnut-sized balls of rice and place on the topping.1\nMake into tight balls. Bring the corners of the cling film together and tighten into balls by twisting it up, then unwrap and serve.",
        "name": "Sushi",
        "tag": null,
        "video_url": "https://www.youtube.com/watch?v=ub68OxEypaY"
    }, 
    {
        "area": "Croatian",
        "category": "Side",
        "id": "53060",
        "img_url": "https://www.themealdb.com/images/media/meals/tkxquw1628771028.jpg",
        "ingredient": "1 Packet Filo Pastry\n150g Minced Beef\n150g Onion\n40g Oil\nDash Salt\nDash Pepper",
        "instructions": "Fry the finely chopped onions and minced meat in oil. Add the salt and pepper. Grease a round baking tray and put a layer of pastry in it. Cover with a thin layer of filling and cover this with another layer of filo pastry which must be well coated in oil. Put another layer of filling and cover with pastry. When you have five or six layers, cover with filo pastry, bake at 200ºC/392ºF for half an hour and cut in quarters and serve.",
        "name": "Burek",
        "tag": "Streetfood, Onthego",
        "video_url": "https://www.youtube.com/watch?v=YsJXZwE5pdY"
    }, 
    {
        "area": "Filipino",
        "category": "Beef",
        "id": "53069",
        "img_url": "https://www.themealdb.com/images/media/meals/4pqimk1683207418.jpg",
        "ingredient": "1 lb Beef\n5 tablespoons Soy Sauce\n1 Lemon\n3 cloves Garlic\n3 parts  Onion\n4 tbs Olive Oil\n1 cup  Water\n1 pinch Salt",
        "instructions": "0. Marinate beef in soy sauce, lemon (or calamansi), and ground black pepper for at least 1 hour. Note: marinate overnight for best result\n1.  Heat the cooking oil in a pan then pan-fry half of the onions until the texture becomes soft. Set aside\n2.  Drain the marinade from the beef. Set it aside. Pan-fry the beef on the same pan where the onions were fried for 1 minute per side. Remove from the pan. Set aside\n3.  Add more oil if needed. Saute garlic and remaining raw onions until onion softens.\n4.  Pour the remaining marinade and water. Bring to a boil.\n5.  Add beef. Cover the pan and simmer until the meat is tender. Note: Add water as needed.\n6.  Season with ground black pepper and salt as needed. Top with pan-fried onions.\n7.  Transfer to a serving plate. Serve hot. Share and Enjoy!",
        "name": "Bistek",
        "tag": null,
        "video_url": "https://www.youtube.com/watch?v=xOQON5_S7as"
    }, 
    {
        "area": "Egyptian",
        "category": "Vegetarian",
        "id": "53026",
        "img_url": "https://www.themealdb.com/images/media/meals/n3xxd91598732796.jpg",
        "ingredient": "3 cups  Broad Beans\n6 Spring Onions\n4 Garlic Clove\n1/4 cup Parsley\n2 tsp Cumin\n1 tsp  Baking Powder\n1/2 tsp Cayenne Pepper\nSpinkling Flour\nAs required Vegetable Oil",
        "instructions": "oak the beans in water to cover overnight.Drain. If skinless beans are unavailable, rub to loosen the skins, then discard the skins. Pat the beans dry with a towel.\nGrind the beans in a food mill or meat grinder.If neither appliance is available, process them in a food processor but only until the beans form a paste. (If blended too smoothly, the batter tends to fall apart during cooking.) Add the scallions, garlic, cilantro, cumin, baking powder, cayenne, salt, pepper, and coriander, if using\nRefrigerate for at least 30 minutes.\nShape the bean mixture into 1-inch balls.Flatten slightly and coat with flour.\nHeat at least 1½-inches of oil over medium heat to 365 degrees.\nFry the patties in batches, turning once, until golden brown on all sides, about 5 minutes.Remove with a wire mesh skimmer or slotted spoon. Serve as part of a meze or in pita bread with tomato-cucumber salad and tahina sauce.",
        "name": "Tamiya",
        "tag": null,
        "video_url": "https://www.youtube.com/watch?v=mulqW-J3Yy4"
    }, 
    {
        "area": "Turkish",
        "category": "Side",
        "id": "52978",
        "img_url": "https://www.themealdb.com/images/media/meals/mlchx21564916997.jpg",
        "ingredient": "2 large Potatoes\n2 tbs Butter\n150g Cheese\n1 large Onion\n1 large Red Pepper\nPinch Red Chile Flakes",
        "instructions": "If you order kumpir in Turkey, the standard filling is first, lots of butter mashed into the potato, followed by cheese. There's then a row of other toppings that you can just point at to your heart's content - sweetcorn, olives, salami, coleslaw, Russian salad, allsorts - and you walk away with an over-stuffed potato because you got ever-excited by the choices on offer.\nGrate (roughly - you can use as much as you like) 150g of cheese.\nFinely chop one onion and one sweet red pepper.\nPut these ingredients into a large bowl with a good sprinkling of salt and pepper, chilli flakes (optional).",
        "name": "Kumpir",
        "tag": "SideDish",
        "video_url": "https://www.youtube.com/watch?v=IEDEtZ4UVtI"
    }, 
    {
        "area": "Chinese",
        "category": "Pork",
        "id": "52948",
        "img_url": "https://www.themealdb.com/images/media/meals/1525876468.jpg",
        "ingredient": "1lb Pork\n3 chopped Garlic Clove\n1 tsp  Ginger\n1 tbs Soy Sauce\n1 tsp  Sesame Seed Oil\n3 finely chopped Carrots\n3 finely chopped Celery\n6 chopped Spring Onions\n1 Packet Wonton Skin\nFry Oil\nBottle Water",
        "instructions": "Combine pork, garlic, ginger, soy sauce, sesame oil, and vegetables in a bowl.\nSeparate wonton skins.\nPlace a heaping teaspoon of filling in the center of the wonton.\nBrush water on 2 borders of the skin, covering 1/4 inch from the edge.\nFold skin over to form a triangle, sealing edges.\nPinch the two long outside points together.\nHeat oil to 450 degrees and fry 4 to 5 at a time until golden.\nDrain and serve with sauce.",
        "name": "Wontons",
        "tag": "MainMeal",
        "video_url": "https://www.youtube.com/watch?v=9h9No18ZyCI"
    }, 
    {
        "area": "Italian",
        "category": "Pasta",
        "id": "52844",
        "img_url": "https://www.themealdb.com/images/media/meals/wtsvxx1511296896.jpg",
        "ingredient": "1 tblsp  Olive Oil\n2 Bacon\n1 finely chopped  Onion\n1 Stick Celery\n1 medium Carrots\n2 cloves chopped Garlic\n500g Minced Beef\n1 tbls Tomato Puree\n800g Chopped Tomatoes\n1 tblsp  Honey\n500g Lasagne Sheets\n400ml Creme Fraiche\n125g Mozzarella Balls\n50g Parmesan Cheese\nTopping Basil Leaves",
        "instructions": "Heat the oil in a large saucepan. Use kitchen scissors to snip the bacon into small pieces, or use a sharp knife to chop it on a chopping board. Add the bacon to the pan and cook for just a few mins until starting to turn golden. Add the onion, celery and carrot, and cook over a medium heat for 5 mins, stirring occasionally, until softened.\nAdd the garlic and cook for 1 min, then tip in the mince and cook, stirring and breaking it up with a wooden spoon, for about 6 mins until browned all over.\nStir in the tomato purée and cook for 1 min, mixing in well with the beef and vegetables. Tip in the chopped tomatoes. Fill each can half full with water to rinse out any tomatoes left in the can, and add to the pan. Add the honey and season to taste. Simmer for 20 mins.\nHeat oven to 200C/180C fan/gas 6. To assemble the lasagne, ladle a little of the ragu sauce into the bottom of the roasting tin or casserole dish, spreading the sauce all over the base. Place 2 sheets of lasagne on top of the sauce overlapping to make it fit, then repeat with more sauce and another layer of pasta. Repeat with a further 2 layers of sauce and pasta, finishing with a layer of pasta.\nPut the crème fraîche in a bowl and mix with 2 tbsp water to loosen it and make a smooth pourable sauce. Pour this over the top of the pasta, then top with the mozzarell\nSprinkle Parmesan over the top and bake for 25–30 mins until golden and bubbling. Serve scattered with basil, if you like.",
        "name": "Lasagne",
        "tag": null,
        "video_url": "https://www.youtube.com/watch?v=gfhfsBPt46s"
    }, 
    {
        "area": "Tunisian",
        "category": "Vegetarian",
        "id": "52971",
        "img_url": "https://www.themealdb.com/images/media/meals/1bsv1q1560459826.jpg",
        "ingredient": "5 Large Potatoes\n2 tbs Olive Oil\n1 Green Pepper\n5 Onions\n1 tbs Ras el hanout\n500g Pumpkin\n24 Skinned Eggs\nPinch Salt\nPinch Pepper",
        "instructions": "Peel potatoes and cut into 5cm cubes.\nPour 1-2 cm of olive oil into a large pan and heat up very hot. Fry potatoes until golden brown for 20 minutes, turning from time to time. Place on kitchen paper to drain.\nCut the peppers in half and remove seeds. Rub a little olive oil on them and place the cut side down on a baking tray. Place them under the grill. Grill until the skin is dark and bubbly. While the peppers are still hot, put them into a plastic sandwich bag and seal it. Take them out after 15 minutes and remove skins.\nIn the meantime, heat more olive oil another pan. Peel the onions and cut into thin rings. Fry for 15 minutes until golden brown, turning them often. Add the Ras el hanout at the end.\nCut the pumpkin into 5cm cubes and fry in the same pan you used for the potatoes for 10-15 minutes until it is soft and slightly browned. Place on kitchen paper.\nPour the remaining olive oil out of the pan and put all the cooked vegetables into the pan and mix. Whisk eggs and pour them over the vegetables. Put the lid on the pan so that the eggs cook. Put the contents of the pan onto a large chopping board, add salt and pepper and chopped and mix everything with a big knife.",
        "name": "Kafteji",
        "tag": null,
        "video_url": "https://www.youtube.com/watch?v=-TFf-Zu-xQU"
    }, 
    {
        "area": "American",
        "category": "Beef",
        "id": "53013",
        "img_url": "https://www.themealdb.com/images/media/meals/urzj1d1587670726.jpg",
        "ingredient": "400g Minced Beef\n2 tbs Olive Oil\n2 Sesame Seed Burger Buns\nChopped Onion\n1/4  Iceberg Lettuce\n2 sliced Cheese\n2 large Dill Pickles\n1 cup  Mayonnaise\n2 tsp White Wine Vinegar\nPinch Pepper\n2 tsp Mustard\n1 1/2 tsp  Onion Salt\n1 1/2 tsp  Garlic Powder\n1/2 tsp Paprika",
        "instructions": "For the Big Mac sauce, combine all the ingredients in a bowl, season with salt and chill until ready to use.\n2. To make the patties, season the mince with salt and pepper and form into 4 balls using about 1/3 cup mince each. Place each onto a square of baking paper and flatten to form into four x 15cm circles. Heat oil in a large frypan over high heat. In 2 batches, cook beef patties for 1-2 minutes each side until lightly charred and cooked through. Remove from heat and keep warm. Repeat with remaining two patties.\n3. Carefully slice each burger bun into three acrossways, then lightly toast.\n4. To assemble the burgers, spread a little Big Mac sauce over the bottom base. Top with some chopped onion, shredded lettuce, slice of cheese, beef patty and some pickle slices. Top with the middle bun layer, and spread with more Big Mac sauce, onion, lettuce, pickles, beef patty and then finish with more sauce. Top with burger lid to serve.\n5. After waiting half an hour for your food to settle, go for a jog.",
        "name": "Big Mac",
        "tag": null,
        "video_url": "https://www.youtube.com/watch?v=C5J39YnnPsg"
    }, 
    {
        "area": "Canadian",
        "category": "Miscellaneous",
        "id": "52804",
        "img_url": "https://www.themealdb.com/images/media/meals/uuyrrx1487327597.jpg",
        "ingredient": "Dash Vegetable Oil\n1 Can Beef Gravy\n5 thin cut Potatoes\n2 cups Cheese Curds",
        "instructions": "Heat oil in a deep fryer or deep heavy skillet to 365°F (185°C).\nWarm gravy in saucepan or microwave.\nPlace the fries into the hot oil, and cook until light brown, about 5 minutes.\nRemove to a paper towel lined plate to drain.\nPlace the fries on a serving platter, and sprinkle the cheese over them.\nLadle gravy over the fries and cheese, and serve immediately.",
        "name": "Poutine",
        "tag": "UnHealthy,Speciality,HangoverFood",
        "video_url": "https://www.youtube.com/watch?v=UVAMAoA2_WU"
    }, 
    {
        "area": "Egyptian",
        "category": "Vegetarian",
        "id": "53027",
        "img_url": "https://www.themealdb.com/images/media/meals/4er7mj1598733193.jpg",
        "ingredient": "1 1/2 cups  Brown Lentils\n1 1/2 cups  Rice\n1/2 tsp Coriander\n2 cups  Macaroni\nCan Chickpeas\n1 large Onion\nSprinking Salt\n1/2 cup  Vegetable Oil",
        "instructions": "Cook the lentils. Bring lentils and 4 cups of water to a boil in a medium pot or saucepan over high heat. Reduce the heat to low and cook until lentils are just tender (15-17 minutes). Drain from water and season with a little salt. (Note: when the lentils are ready, they should not be fully cooked. They should be only par-cooked and still have a bite to them as they need to finish cooking with the rice).\nNow, for the rice. Drain the rice from its soaking water. Combine the par-cooked lentils and the rice in the saucepan over medium-high heat with 1 tbsp cooking oil, salt, pepper, and coriander. Cook for 3 minutes, stirring regularly. Add warm water to cover the rice and lentil mixture by about 1 1/2 inches (you’ll probably use about 3 cups of water here). Bring to a boil; the water should reduce a bit. Now cover and cook until all the liquid has been absorbed and both the rice and lentils are well cooked through (about 20 minutes).  Keep covered and undisturbed for 5 minutes or so.\nNow make the pasta. While the rice and lentils are cooking, make the pasta according to package instructions by adding the elbow pasta to boiling water with a dash of salt and a little oil. Cook until the pasta is al dente. Drain.\nCover the chickpeas and warm in the microwave briefly before serving.\nMake the crispy onion topping. \nSprinkle the onion rings with salt, then toss them in the flour to coat. Shake off excess flour.\nIn a large skillet, heat the cooking oil over medium-high heat, cook the onion rings, stirring often, until they turn a nice caramelized brown. Onions must be crispy, but not burned (15-20 minutes).",
        "name": "Koshari",
        "tag": null,
        "video_url": "https://www.youtube.com/watch?v=y0d2ZMZBW4Y"
    }, 
    {
        "area": "Indian",
        "category": "Vegetarian",
        "id": "52785",
        "img_url": "https://www.themealdb.com/images/media/meals/wuxrtu1483564410.jpg",
        "ingredient": "1 cup Toor dal\n2-1/2 cups Water\n1 tsp Salt\n1/4 tsp Turmeric\n3 tbs Ghee\n1 cup Chopped tomatoes\n1/2 tsp Cumin seeds\n1/2 tsp Mustard Seeds\n2 Bay Leaf\n1 tbs chopped Green Chili\n2 tsp shredded Ginger\n2 tbs  Cilantro\n1/2 tsp Red Pepper\n1/2 tsp Salt\n1 tsp Sugar\n1/4 tsp Garam Masala",
        "instructions": "Wash and soak toor dal in approx. 3 cups of water, for at least one hours. Dal will be double in volume after soaking. Drain the water.\nCook dal with 2-1/2 cups water and add salt, turmeric, on medium high heat, until soft in texture (approximately 30 mins) it should be like thick soup.\nIn a frying pan, heat the ghee. Add cumin seeds, and mustard seeds. After the seeds crack, add bay leaves, green chili, ginger and chili powder. Stir for a few seconds.\nAdd tomatoes, salt and sugar stir and cook until tomatoes are tender and mushy.\nAdd cilantro and garam masala cook for about one minute.\nPour the seasoning over dal mix it well and cook for another minute.\nServe with Naan.",
        "name": "Dal fry",
        "tag": "Curry,Vegetarian,Cake",
        "video_url": "https://www.youtube.com/watch?v=J4D855Q9-jg"
    }, 
    {
        "area": "Canadian",
        "category": "Dessert",
        "id": "52929",
        "img_url": "https://www.themealdb.com/images/media/meals/txsupu1511815755.jpg",
        "ingredient": "2 cups  Flour\n1/3 cup Sugar\n3 tsp Baking Powder\n½ tsp Salt\n1 beaten Egg\n¾ cup Milk\n3 tbs Oil\nfor frying Oil\ngarnish Icing Sugar",
        "instructions": "Sift together dry ingredients.\nMix together wet ingredients and incorporate into dry. Stir until smooth.\nDrop by teaspoonfuls(no bigger) into hot oil (365 degrees, no hotter), turning after a few moments until golden brown on all sides.\nRemove and drain.\nRoll in cinnamon sugar while still warm and serve.",
        "name": "Timbits",
        "tag": "Snack,Treat",
        "video_url": "https://www.youtube.com/watch?v=fFLn1h80AGQ"
    }, 
    {
        "area": "American",
        "category": "Dessert",
        "id": "52854",
        "img_url": "https://www.themealdb.com/images/media/meals/rwuyqx1511383174.jpg",
        "ingredient": "100g  Flour\n2 large Eggs\n300ml  Milk\n1 tbls Sunflower Oil\nto serve Sugar\nto serve Raspberries\nto serve Blueberries",
        "instructions": "Put the flour, eggs, milk, 1 tbsp oil and a pinch of salt into a bowl or large jug, then whisk to a smooth batter. Set aside for 30 mins to rest if you have time, or start cooking straight away.\nSet a medium frying pan or crêpe pan over a medium heat and carefully wipe it with some oiled kitchen paper. When hot, cook your pancakes for 1 min on each side until golden, keeping them warm in a low oven as you go.\nServe with lemon wedges and sugar, or your favourite filling. Once cold, you can layer the pancakes between baking parchment, then wrap in cling film and freeze for up to 2 months.",
        "name": "Pancakes",
        "tag": "Breakfast,Desert,Sweet,Fruity",
        "video_url": "https://www.youtube.com/watch?v=LWuuCndtJr0"
    }, 
    {
        "area": "Dutch",
        "category": "Lamb",
        "id": "52769",
        "img_url": "https://www.themealdb.com/images/media/meals/sxysrt1468240488.jpg",
        "ingredient": "250 Grams Fries\n500 Grams Doner Meat\nTopping Garlic sauce\nTopping Hotsauce\n1 Bulb Lettuce\n1 Tomato\n3rd Cucumber\n100 Grams Gouda cheese",
        "instructions": "Cut the meat into strips. Heat oil in a pan and fry the strips for 6 minutes until it's ready.\nBake the fries until golden brown in a deep fryrer. When ready transfer to a backing dish. Make sure the fries are spread over the whole dish.\nCover the fries with a new layer of meat and spread evenly.\nAdd a layer of cheese over the meat. You can also use grated cheese. When done put in the oven for a few minutes until the cheese is melted.\nChop the lettuce, tomato and cucumber in small pieces and mix together. for a basic salad. As extra you can add olives jalapenos and a red union.\nDived the salad over the dish and Serve with garlicsauce and hot sauce",
        "name": "Kapsalon",
        "tag": "Snack",
        "video_url": "https://www.youtube.com/watch?v=UIcuiU1kV8I"
    }, 
    {
        "area": "British",
        "category": "Seafood",
        "id": "52802",
        "img_url": "https://www.themealdb.com/images/media/meals/ysxwuq1487323065.jpg",
        "ingredient": "900g Floury Potatoes\n2 tbsp Olive Oil\n600ml Semi-skimmed Milk\n800g White Fish Fillets\n1 tbsp Plain flour\nGrating Nutmeg\n3 tbsp Double Cream\n200g Jerusalem Artichokes\n1 finely sliced Leek\n200g peeled raw Prawns\nLarge handful Parsley\nHandful Dill\nGrated zest of 1 Lemon\n25g grated Gruyère\nJuice of 1 Lemon",
        "instructions": "01.Put the potatoes in a large pan of cold salted water and bring to the boil. Lower the heat, cover, then simmer gently for 15 minutes until tender. Drain, then return to the pan over a low heat for 30 seconds to drive off any excess water. Mash with 1 tbsp olive oil, then season.\n02.Meanwhile put the milk in a large sauté pan, add the fish and bring to the boil. Remove from the heat, cover and stand for 3 minutes. Remove the fish (reserving the milk) and pat dry with kitchen paper, then gently flake into an ovenproof dish, discarding the skin and any bones.\n03.Heat the remaining oil in a pan, stir in the flour and cook for 30 seconds. Gradually stir in 200-250ml of the reserved milk (discard the rest). Grate in nutmeg, season, then bubble until thick. Stir in the cream.\n04.Preheat the oven to 190°C/fan170°C/gas 5. Grate the artichokes and add to the dish with the leek, prawns and herbs. Stir the lemon zest and juice into the sauce, then pour over. Mix gently with a wooden spoon.\n05.Spoon the mash onto the fish mixture, then use a fork to make peaks, which will crisp and brown as it cooks. Sprinkle over the cheese, then bake for 35-40 minutes until golden and bubbling. Serve with wilted greens.",
        "name": "Fish pie",
        "tag": "Fish,Pie,Breakfast,Baking",
        "video_url": "https://www.youtube.com/watch?v=2sX4fCgg-UI"
    }, 
    {
        "area": "French",
        "category": "Vegetarian",
        "id": "52906",
        "img_url": "https://www.themealdb.com/images/media/meals/wssvvs1511785879.jpg",
        "ingredient": "75g Butter\n1kg Leek\n½ tsp Salt\n300ml  Creme Fraiche\n1 Egg\n3 Egg Yolks\n¼ teaspoon Nutmeg\n225g Plain Flour\n½ tsp Salt\n60g Butter\n60g Lard\n50g Cheddar Cheese\n2 tbs Water",
        "instructions": "For the pastry, sift the flour and salt into the bowl of a food processor, add the butter and lard, then whizz together briefly until the mixture looks like fine breadcrumbs. Tip the mixture into a bowl, then stir in the cheese and enough of the water for the mixture to come together. Tip out onto a lightly floured surface and knead briefly until smooth. Roll out thinly and line a 23cm x 4cm loose-?bottomed fluted flan tin. Prick the base with a fork. Chill for 20 minutes.\n02.Melt the 75g butter in a saucepan over a low heat, then add the leeks and the salt. Cover and cook for ?10 minutes until soft. Uncover the pan, increase the heat and cook ?for 2 minutes, stirring occasionally, until the liquid has evaporated. Spoon onto a plate and leave to cool.\n03.Preheat the oven to 200°C/fan180°C/gas 6. Line the pastry case with baking paper and baking beans or rice and blind bake for 15-20 minutes until the edges are biscuit-coloured. Remove the paper and beans/rice and return the case to the oven for 7-10 minutes until the base is crisp and lightly golden. Remove and set aside. Reduce the oven temperature to 190°C/fan170°C/gas 5.\n04.Put the crème fraîche into a bowl with the whole egg, egg yolks and nutmeg. Lightly beat together, then season. Stir in the leeks. Spoon ?the mixture into the tart case and bake for 35-40 minutes until set ?and lightly golden. Remove from ?the oven and leave for 10 minutes. Take out of the tin and serve.",
        "name": "Flamiche",
        "tag": "Tart",
        "video_url": "https://www.youtube.com/watch?v=vT0q5c880Rg"
    }, 
    {
        "area": "Egyptian",
        "category": "Chicken",
        "id": "53028",
        "img_url": "https://www.themealdb.com/images/media/meals/kcv6hj1598733479.jpg",
        "ingredient": "1 kg Chicken Thighs\n1 tbs Coriander\n1 tbs Cumin\n1 tbs Cardamom\n1 tsp  Cayenne Pepper\n2 tsp Paprika\n2 tbs Lemon Juice\n3 tbs Olive Oil\n1 cup  Greek Yogurt\n1 Garlic Clove\n1 tsp  Cumin\nSplash Lemon Juice\nSliced Lettuce\nSliced Tomato\n6 Pita Bread",
        "instructions": "Combine the marinade ingredients in a large ziplock bag (or bowl).\nAdd the chicken and use your hands to make sure each piece is coated. If using a ziplock bag, I find it convenient to close the bag then massage the bag to disperse the rub all over each chicken piece.\nMarinate overnight or up to 24 hours.\nCombine the Yoghurt Sauce ingredients in a bowl and mix. Cover and put in the fridge until required (it will last for 3 days in the fridge).\nHeat grill/BBQ (or large heavy based pan on stove) on medium high. You should not need to oil it because the marinade has oil in it and also thigh fillets have fat. But if you are worried then oil your hotplate/grill. (See notes for baking)\nPlace chicken on the grill and cook the first side for 4 to 5 minutes until nicely charred, then turn and cook the other side for 3 to 4 minutes (the 2nd side takes less time).\nRemove chicken from the grill and cover loosely with foil. Set aside to rest for 5 minutes.\nTO SERVE\nSlice chicken and pile onto platter alongside flatbreads, Salad and the Yoghurt Sauce.\nTo make a wrap, get a piece of flatbread and smear with Yoghurt Sauce. Top with a bit of lettuce and tomato and Chicken Shawarma. Roll up and enjoy!",
        "name": "Shawarma",
        "tag": null,
        "video_url": "https://www.youtube.com/watch?v=3lxUIeKDgic"
    }, 
    {
        "area": "British",
        "category": "Seafood",
        "id": "52887",
        "img_url": "https://www.themealdb.com/images/media/meals/utxqpt1511639216.jpg",
        "ingredient": "300g Smoked Haddock\n2 Bay Leaves\n300ml  Milk\n4 Eggs\nHandful Parsley\nHandful Coriander\n2 tbs Vegetable Oil\n1 chopped Onion\n1 tsp  Coriander\n2 tsp Curry Powder\n300g Rice",
        "instructions": "For the rice, heat the oil in a large, lidded pan, add the onion, then gently fry for 5 mins until softened but not coloured. Add the spices, season with salt, then continue to fry until the mix start to go brown and fragrant; about 3 mins.\nAdd the rice and stir in well. Add 600ml water, stir, then bring to the boil. Reduce to a simmer, then cover for 10 mins. Take off the heat and leave to stand, covered, for 10-15 mins more. The rice will be perfectly cooked if you do not lift the lid before the end of the cooking.\nMeanwhile, put the haddock and bay leaves in a frying pan, cover with the milk, then poach for 10 mins until the flesh flakes. Remove from the milk, peel away the skin, then flake the flesh into thumbsize pieces. Place the eggs in a pan, cover with water, bring to the boil, then reduce to a simmer. Leave for 4½-5 mins, plunge into cold water, then peel and cut the eggs into quarters. Gently mix the fish, eggs, parsley, coriander and rice together in the pan. Serve hot, sprinkled with a few extra herbs.",
        "name": "Kedgeree",
        "tag": null,
        "video_url": "https://www.youtube.com/watch?v=_Pw1I1-SItE"
    }, 
    {
        "area": "Dutch",
        "category": "Pork",
        "id": "52980",
        "img_url": "https://www.themealdb.com/images/media/meals/hyarod1565090529.jpg",
        "ingredient": "1.5kg Potatoes\n2 leaves Bay Leaf\n2 Shallots\n3 tbs Butter\n750g Kale\n2 Sausages\n500ml Milk\nGrated Nutmeg\nPinch Salt\nPinch Pepper",
        "instructions": "\nWash and peel the potatoes and cut into similarly sized pieces for even cooking.\nIn a large soup pot, boil the potatoes and the bay leaves in salted water for 20 minutes. Discard the bay leaves.\nIf you're not using a bag of ready-cut curly kale, wash the bunches thoroughly under cool running water to get rid of all soil—you wouldn't want that gritty texture in your finished dish. Trim any coarse stems and discard any brown leaves. With a sharp knife, cut the curly kale into thin strips.\nPeel and chop the shallots.\nIn a frying pan or skillet, melt 1 tbsp. of butter and saute the shallots for a few minutes before adding the curly kale and 2 tbsp. of water. Season and cook for about 10 minutes, or until tender.\nWarm the milk on the stove or in the microwave.\nDrain, shake and dry the potatoes with kitchen towels before mashing with a potato masher or ricer. Working quickly, add the warm milk and the remaining butter. Season to taste with nutmeg, salt, and pepper. \nMix the cooked curly kale through the cooked mashed potato mixture.\nTop with slices of the smoked sausage and serve hot with your favorite mustard or gravy.\nServe and enjoy!",
        "name": "Stamppot",
        "tag": "Savory,Breakfast",
        "video_url": "https://www.youtube.com/watch?v=hTrSXryX31A"
    }, 
    {
        "area": "Greek",
        "category": "Beef",
        "id": "53006",
        "img_url": "https://www.themealdb.com/images/media/meals/ctg8jd1585563097.jpg",
        "ingredient": "500g Beef\n1 large Aubergine\n150g Greek Yogurt\n1 beaten Egg\n3 tbs Parmesan\n400g Tomato\n4 tbs Tomato Puree\n350g Potatoes",
        "instructions": "Heat the grill to high. Brown the beef in a deep ovenproof frying pan over a high heat for 5 mins. Meanwhile, prick the aubergine with a fork, then microwave on High for 3-5 mins until soft. Mix the yogurt, egg and parmesan together, then add a little seasoning.\nStir the tomatoes, purée and potatoes in with the beef with some seasoning and heat through. Smooth the surface of the beef mixture with the back of a spoon, then slice the cooked aubergine and arrange on top. Pour the yogurt mixture over the aubergines, smooth out evenly, then grill until the topping has set and turned golden.",
        "name": "Moussaka",
        "tag": null,
        "video_url": "https://www.youtube.com/watch?v=8U_29i9Qp5U"
    }, 
    {
        "area": "Egyptian",
        "category": "Vegetarian",
        "id": "52963",
        "img_url": "https://www.themealdb.com/images/media/meals/g373701551450225.jpg",
        "ingredient": "1 tbs Olive Oil\n2 chopped Red Onions\n1 finely chopped  Red Chilli\n1 clove Garlic\nChopped Coriander\n800g Cherry Tomatoes\n1 tbs Caster Sugar\n4 Eggs\nSpinkling Feta",
        "instructions": "Heat the oil in a frying pan that has a lid, then soften the onions, chilli, garlic and coriander stalks for 5 mins until soft. Stir in the tomatoes and sugar, then bubble for 8-10 mins until thick. Can be frozen for 1 month.\nUsing the back of a large spoon, make 4 dips in the sauce, then crack an egg into each one. Put a lid on the pan, then cook over a low heat for 6-8 mins, until the eggs are done to your liking. Scatter with the coriander leaves and serve with crusty bread.",
        "name": "Shakshuka",
        "tag": "Egg,Brunch,Breakfast",
        "video_url": "https://www.youtube.com/watch?v=C-3_jYrfdBU"
    }, 
    {
        "area": "Canadian",
        "category": "Dessert",
        "id": "52931",
        "img_url": "https://www.themealdb.com/images/media/meals/yrstur1511816601.jpg",
        "ingredient": "2 cups  Brown Sugar\n¼ cup Butter\n2 Eggs\n1 tsp  Vanilla Extract\n1 tsp  Salt\n½ cup  Plain Flour\n1 1/2 cups  Milk",
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9-inch pie dish.\nPlace the brown sugar and butter in a mixing bowl, and beat them together with an electric mixer until creamy and very well combined, without lumps. Beat in eggs, one at a time, incorporating the first egg before adding the next one. Add the vanilla extract and salt; beat the flour in, a little at a time, and then the milk, making a creamy batter. Pour the batter into the prepared pie dish.\nBake in the preheated oven for 35 minutes; remove pie, and cover the rim with aluminum foil to prevent burning. Return to oven, and bake until the middle sets and the top forms a crusty layer, about 15 more minutes. Let the pie cool to room temperature, then refrigerate for at least 1 hour before serving.",
        "name": "Sugar Pie",
        "tag": "Pie,Desert",
        "video_url": "https://www.youtube.com/watch?v=uVQ66jiL-Dc"
    }, 
    {
        "area": "Italian",
        "category": "Vegetarian",
        "id": "52811",
        "img_url": "https://www.themealdb.com/images/media/meals/xrrwpx1487347049.jpg",
        "ingredient": "5 tablespoons Olive Oil\n1 chopped Onion\n1 chopped Carrot\n1 stalk chopped Celery\n1 tablespoon minced Garlic\n2 cups Cannellini Beans\n1 Canned tomatoes\n4 cups Water\n1 fresh sprig Rosemary\n1 fresh sprig Thyme\n1 pound chopped Kale\n4 thick slices Wholegrain Bread\n1 thinly sliced Red Onion\n½ cup freshly grated Parmesan",
        "instructions": "Put 2 tablespoons of the oil in a large pot over medium heat. When it's hot, add onion, carrot, celery and garlic; sprinkle with salt and pepper and cook, stirring occasionally, until vegetables are soft, 5 to 10 minutes.\nHeat the oven to 500 degrees. Drain the beans; if they're canned, rinse them as well. Add them to the pot along with tomatoes and their juices and stock, rosemary and thym\nBring to a boil, then reduce heat so the soup bubbles steadily; cover and cook, stirring once or twice to break up the tomatoes, until the flavors meld, 15 to 20 minutes.\nFish out and discard rosemary and thyme stems, if you like, and stir in kale. Taste and adjust seasoning. Lay bread slices on top of the stew so they cover the top and overlap as little as possible. Scatter red onion slices over the top, drizzle with the remaining 3 tablespoons oil and sprinkle with Parmesan.\nPut the pot in the oven and bake until the bread, onions and cheese are browned and crisp, 10 to 15 minutes. (If your pot fits under the broiler, you can also brown the top there.) Divide the soup and bread among 4 bowls and serve.",
        "name": "Ribollita",
        "tag": "Vegetarian",
        "video_url": "https://www.youtube.com/watch?v=BiQUYTBb6eQ"
    }
]